PANDS LIB

In [2]:
import pandas as pd
#Dataframe
df=pd.read_csv("employee_detail.csv")
df

   employeeid emaployeename  salary department     branch
0           1        sameer   45000         hr     mumbai
1           2        Ramesh   35000      admin      delhi
2           3        Hitesh   65000         hr     mumbai
3           4        nitesh   95000      sales  bangalore
4           5        jayesh   75000      sales     mumbai

In [3]:
import pandas as pd
#Dataframe
df=pd.read_csv("employee_detail.csv")
df["branch"]

0       mumbai
1        delhi
2       mumbai
3    bangalore
4       mumbai
Name: branch, dtype: object

In [7]:
import pandas as pd
#Dataframe
df=pd.read_csv("employee_detail.csv")
df.branch

0       mumbai
1        delhi
2       mumbai
3    bangalore
4       mumbai
Name: branch, dtype: object

In [20]:
import pandas as pd
#Dataframe
df=pd.read_csv("employee_detail.csv")
df[df["branch"]=="mumbai"]

   employeeid emaployeename  salary department  branch
0           1        sameer   45000         hr  mumbai
2           3        Hitesh   65000         hr  mumbai
4           5        jayesh   75000      sales  mumbai

In [2]:
import pandas as pd
df=pd.read_csv("employee_detail.csv")
# Retrieve multiple columns
df=[["employeeid", "employeename"]]